backend/app/controllers/application_controller.rb

INSERT INTO "users" ("username", "password_digest") VALUES (?, ?)  [["username", "test"], ["password_digest", "$2a$12$uu28fuB/r5kMdRFDOhSc9.AVQyFzl..TQecqlL/ak8SfM8iL.tyVm"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kevin"], ["LIMIT", 1]]
---
  def create
    user = User.new(sign_up_params)
    if user.save
      #render json: {status: "SUCCESS", message: "added a new user!", data: user}, status: :ok
      user = User.find_by(username: params[:username])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jack"], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE (user_id = 3) ORDER BY name
---
  def login
    user = User.find_by(username: params[:username])
    if user && user.authenticate(params[:password])
      characters = Character.where("user_id = ?", user.id).alphabetical