backend/app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def create
    @character = Character.new(character_params)
    if @character.save
      characters = Character.where("user_id = ?", @character.user_id).alphabetical
---
INSERT INTO "characters" ("name", "race", "character_class", "alignment", "strength", "dexterity", "constitution", "intelligence", "wisdom", "charisma", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "characters".* FROM "characters" WHERE (user_id = 3) ORDER BY name

  def destroy
    @user_id = @character.user_id
    @character.destroy
    characters = Character.where("user_id = ?", @user_id).alphabetical
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
SELECT "characters".* FROM "characters" WHERE (user_id = 3) ORDER BY name

    def set_character
      @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]